package curriculum.f;

public class Employee {

	/*-------------------------------------------------------------------------
	[概要] 「オブジェクト指向」の課題「基本概念」において使用される「フィールド変数」
	-------------------------------------------------------------------------*/
	
	private String employeeId;
	private String name;
	
	/*-------------------------------------------------------------------------
	[概要] 「オブジェクト指向」の課題「基本概念」において使用される「setter」
	-------------------------------------------------------------------------*/
	
	public void setEmployeeId( String employeeId ) {
	 this.employeeId = employeeId;
	}
	
	public void setName( String name ) {
     this.name = name;
	}
	
	/*-------------------------------------------------------------------------
	[概要] 「オブジェクト指向」の課題「基本概念」において使用される「『文章を出力させる』メソッド」
	-------------------------------------------------------------------------*/
	
	public void showInfo() {
	 System.out.println( "社員ID:" + this.employeeId + "," + "名前:" + this.name );
	}
	
}