package curriculum.a;

/**********************************************************************************
* [概要] Question1 課題処理
* [詳細] Question1 ～ Question7 までの課題内容およびそれに基づく解答結果を出力する。
**********************************************************************************/

public class Question1 {
	
	/*-------------------------------------------------------------------------
	[概要] Question1 ～ Question13 の解答
	-------------------------------------------------------------------------*/
	
	public static void main(String[] args) {
		
		/*-------------------------------------------------------------------------
		[概要] Question1 : 変数宣言および初期値入力
		-------------------------------------------------------------------------*/
		
		byte byteNum = 8;
		short shortNum = 16;
		int intNum = 32;
		long longNum = 64;
		float floatNum = 3.2f; // メモ : f を入れないとdouble型になってしまう
		double doubleNum = 6.4;
		char letter = 'A';
		String letters = "JavaCurriculumQuestion1"; // 疑問 : クラス名と同じため青文字表記になっている？
		boolean isBoolean = false;
		
		
		/*-------------------------------------------------------------------------
		[概要] Question2 : Question1 で宣言した各変数への代入
		-------------------------------------------------------------------------*/
		
		byteNum = 10;
		shortNum = 100;
		intNum = 1000;
		longNum = 10000;
		floatNum = 9.5f;
		doubleNum = 10.5;
		letter = 'a';
		letters = "ハロー";
		isBoolean = true;
		
		
		/*-------------------------------------------------------------------------
		[概要] Question3 : Question2 で値を代入した変数を使用して出力
		-------------------------------------------------------------------------*/
		
		System.out.println( byteNum + shortNum + intNum + longNum ); // 11110 をコンソールに出力
		System.out.println( byteNum * 2 ); // 20 をコンソールに出力
		System.out.println( letter + " " + letters + " " + isBoolean ); // a ハロー true をコンソールに出力
		System.out.println( byteNum + shortNum + intNum + longNum + floatNum + doubleNum ); // 数字をすべて足したものをコンソールに出力
		System.out.println( byteNum * shortNum * intNum * longNum ); // 小数点以外の数字をすべてかけたものをコンソールに出力
		System.out.println( doubleNum / shortNum ); // 10.5 割る 100 の結果をコンソールに出力
		System.out.println( byteNum - shortNum ); // 10 引く 100 の結果をコンソールに出力
		
		
		/*-------------------------------------------------------------------------
		[概要] Question4 : String型の変数を使った文をコンソールに出力
		-------------------------------------------------------------------------*/
		
		String name = "山田太郎";
		System.out.println( "こんにちは、" + name + "さん！" );
		
		
		/*-------------------------------------------------------------------------
		[概要] Question5 : int型の変数を使った文をコンソールに出力
		-------------------------------------------------------------------------*/
		
		int age = 25;
		System.out.println( "年齢:" + age + "歳" );
		
		
		/*-------------------------------------------------------------------------
		[概要] Question6 : int型の変数を２つ使い、それらの合算結果を変数化したものをコンソールに出力
		-------------------------------------------------------------------------*/
		
		int num1 = 10;
		int num2 = 5;
		int sum = num1 + num2;
		System.out.println( sum );
		
		
		/*-------------------------------------------------------------------------
		[概要] Question7 : int型の変数を加算して更新した結果をコンソールに出力
		-------------------------------------------------------------------------*/
		
		int score = 80;
		score += 20;
		System.out.println( score );
		
		
		/*-------------------------------------------------------------------------
		[概要] Question8 : double型の変数をint型に変換した結果をコンソールに出力
		-------------------------------------------------------------------------*/
		
		double price = 99.99;
		price = (int)price;
		System.out.println( "整数価格:" + (int)price ); // メモ : とりあえず、別のint型の変数の宣言を挟まずに行う方法を採用
		
		
		/*-------------------------------------------------------------------------
		[概要] Question9 : String型の変数に数字を初期値として設定し、それをint型に変換してから加算した結果をコンソールに出力
		-------------------------------------------------------------------------*/
		
		String numStr = "123";
		int intNumStr = Integer.parseInt(numStr); // 疑問 : こちらは別の変数を経由 → そもそも、String型のままおこなった場合とどちらが良いのか？
		System.out.println( intNumStr + 10 );
		
		
		/*-------------------------------------------------------------------------
		[概要] Question10 : int型の変数をString型の変数に変換してからコンソールに出力
		-------------------------------------------------------------------------*/
		
		int num = 50;
		String strNum = String.valueOf(num);
		System.out.println( "得点:" + strNum + "点" );
		
		
		/*-------------------------------------------------------------------------
		[概要] Question11 : int型の変数２つの数値を演算子を用いて比較し、その結果を表すboolean型の変数をコンソールに出力
		-------------------------------------------------------------------------*/
		
		int a = 10;
		int b = 20;
		boolean result = ( a < b );
		System.out.println( result );
		
		
		/*-------------------------------------------------------------------------
		[概要] Question12 : int型の変数を条件式を使用して判定し、その結果をコンソールに出力
		-------------------------------------------------------------------------*/
		
		int x =15;
		System.out.println( x >= 10 ? "OK" : "NG" );
		
		
		/*-------------------------------------------------------------------------
		[概要] Question13 : String型の変数の中にある一部分を置き換えてからコンソールに出力 ※1
		-------------------------------------------------------------------------*/
		
		String text = "私はJavaが好きです。Javaは楽しい！";
		String textWord = "Python";
		text = "私は" + textWord + "が好きです。" + textWord + "は楽しい！";
		System.out.println( text );
		
		/* 別パターン : 「replace」を使用
		String text = "私はJavaが好きです。Javaは楽しい！";
		text = text.replace("Java","Python");
		System.out.println( text );
		*/
		
	}

}
