package curriculum.b;

/**********************************************************************************
* [概要] Question 5_4 で使用する処理
* [詳細] Question 5_4の課題内容に基づき文章を出力する。
**********************************************************************************/

public class Greeting {

	/*-------------------------------------------------------------------------
	[概要] Question 5_4 の課題における「Main」クラスから呼ばれるクラス
	-------------------------------------------------------------------------*/
	
	public void sayHello() {
     System.out.println( "こんにちは！" );
	}
	
}
