package curriculum.h;

public abstract class Employee {

	/*-------------------------------------------------------------------------
	[概要] 「オブジェクト指向」の課題「継承」において使用される「フィールド変数」
	-------------------------------------------------------------------------*/
	
	private String employeeId;
	private String name;
	
	/*-------------------------------------------------------------------------
	[概要] 「オブジェクト指向」の課題「継承」において使用される「コンストラクタ」
	-------------------------------------------------------------------------*/
	
	public Employee(String employeeId,String name) {
	 this.employeeId = employeeId;
	 this.name = name;
	}
	
	/*-------------------------------------------------------------------------
	[概要] 「オブジェクト指向」の課題「継承」において使用される「getter」
	-------------------------------------------------------------------------*/
	
	public String getEmployeeId() {
	 return this.employeeId;
	}
	
	public String getName() {
	 return this.name;
	}
	
	/*-------------------------------------------------------------------------
	[概要] 「オブジェクト指向」の課題「継承」において使用される「抽象メソッド」（日給計算用）
	-------------------------------------------------------------------------*/
	
	public abstract int calculateDailyWage( int hoursWorked ) ;
	
}
