package curriculum.SelfIntroduction;

/**********************************************************************************
* [概要] 課題 7.23 「自己紹介プログラム」の課題にて使用する「『自己紹介用の個人データ』クラス」
* [詳細] 
* ① プライベート変数「名前（String name）」、「年齢（int age）」、「身長（double height）」、「体重（weight）」所持する
* ② パブリック変数「紹介人数（int count）」を所持する
* ③ コンストラクタは固有で所持する
* ④ BMIを計算するメソッド「culculateBMI」を所持する
* ⑤ 名前、年、（④で計算した）BMI、および「紹介した人数」を出力するメソッド「print」を所持する 
**********************************************************************************/

public class Person {

		/*-------------------------------------------------------------------------
		[概要] ①「プライベート変数」：「名前（String name）」、「年（int age）」、「身長（double height）」
		→ 途中の問題４で「体重（weight）」も追加
		-------------------------------------------------------------------------*/
		private String name;
	 	private int age;
	 	private double height;
	 	private double weight;
	 	
	 	/*-------------------------------------------------------------------------
		[概要] ②「パブリック変数」：「紹介人数（int count）」（クラス共通）
		-------------------------------------------------------------------------*/
	 	public static int count = 0;
	 	
	 	/*-------------------------------------------------------------------------
		[概要] ③「コンストラクタ」：名前、年、身長を初期設定する
		→ 途中の問題４で「体重」も追加
		-------------------------------------------------------------------------*/
		
	 	public Person(String name, int age, double height, double weight) {
	     this.name = name;
	     this.age = age;
	     this.height = height;
	     this.weight = weight;
	     Person.count++;
	    }
		
	 	/*-------------------------------------------------------------------------
		[概要] ④「メソッド『culculateBMI』：インスタンスの「身長」と「体重」からBMIを計算して（変数「bmi」にして）、それをMainへ返す
		-------------------------------------------------------------------------*/
	 	
	 	public double culculateBMI() {
	 	 double bmi = this.weight / ( this.height * this.height );
	 	 return bmi;
	 	}
	 	
	 	/*-------------------------------------------------------------------------
		[概要] ⑤「メソッド『print』：インスタンスの名前、年、BMI、および「紹介した人数」の合計を出力する
		-------------------------------------------------------------------------*/
	 	
	 	public void print() {
	 	 System.out.println("名前は" + this.name + "です");
	 	 System.out.println("年は" + this.age + "です");
	 	 System.out.println("BMIは" + culculateBMI() + "です");
	 	 
	 	}
	 	
}