package curriculum.e;

public class Employee {

	/*-------------------------------------------------------------------------
	[概要] 「オブジェクト指向」の課題「基本概念」において使用される「フィールド変数」
	-------------------------------------------------------------------------*/
	
	private String name;
	
	/*-------------------------------------------------------------------------
	[概要] 「オブジェクト指向」の課題「基本概念」において使用される「setter」
	-------------------------------------------------------------------------*/
	
	public void setName( String name ) {
     this.name = name;
	}
	
	/*-------------------------------------------------------------------------
	[概要] 「オブジェクト指向」の課題「基本概念」において使用される「『文章を出力させる』メソッド」
	-------------------------------------------------------------------------*/
	
	public void work() {
	 System.out.println( this.name + "は働いています。" );
	}
	
}
